#include "WaterGround.h"

//=============================================================================
// 初期化
//=============================================================================
void WaterGround::Initialize(Object3dCommon* object3dCommon, const std::string& filePath) {
	Object3d::Initialize(object3dCommon, filePath);

	model_->GetMesh()->GetMaterial()->SetTextureFilePath("white1x1.png");
}

//=============================================================================
// 更新
//=============================================================================
void WaterGround::Update() {
	Object3d::Update();
}

//=============================================================================
// 描画
//=============================================================================
void WaterGround::Draw() {
	Object3d::Draw();
}

//=============================================================================
// ImGuiでのデバッグ処理
//=============================================================================
void WaterGround::ImGuiDebug() {
	Object3d::UpdateImGui("WaterGround");
}