#include "mathEnv.h"

//============================================================================
// radianDegree変換関数
//============================================================================
float radianToDegree(float radian) {
    return radian * kRad2Deg;
}

//============================================================================
// degreeToRadian変換関数
//============================================================================
float degreeToRadian(float degree) {
    return degree * kDeg2Rad;
}
